ИСПП/src/Catalogs/КлючиАналитикиВидаУчета/КлючиАналитикиВидаУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиАналитикиВидаУчета</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Catalog>

ИСПП/src/Catalogs/КлючиАналитикиВидаУчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Механизм расширенных ключей аналитики

// Формирует наименование ключа аналитики
//
// Параметры:
//  ПараметрыАналитики - значения полей создаваемого ключа аналитики
//
//@skip-check doc-comment-field-type-strict
//@skip-check doc-comment-export-function-return-section
//@skip-check doc-comment-field-type
Функция ПолучитьНаименованиеКлючаАналитики(ПараметрыАналитики) Экспорт
	
	Возврат СокрЛП(ПараметрыАналитики.Организация)
		+ ?(ЗначениеЗаполнено(ПараметрыАналитики.Склад), "; " + СокрЛП(ПараметрыАналитики.Склад), "")
		+ "";
	
КонецФункции

// Заполняет наименование ключа аналитики
//
// Параметры:
//  КлючАналитики   - ссылка ключа аналитики, у которого заполняется наименование
//  ПараметрыАналитики - значения полей создаваемого ключа аналитики
//
//@skip-check doc-comment-field-type-strict
//@skip-check doc-comment-field-type
Процедура ЗаполнитьНаименованиеКлючаАналитики(КлючАналитики, ПараметрыАналитики) Экспорт
	
	КлючАналитики.Наименование = ПолучитьНаименованиеКлючаАналитики(ПараметрыАналитики);
	
КонецПроцедуры

// Возвращает существующий или новый ключ аналитики
//
// Параметры:
//  ПараметрыАналитики - значения полей создаваемого ключа аналитики
//
//@skip-check doc-comment-field-type
//@skip-check doc-comment-field-type-strict
//@skip-check doc-comment-export-function-return-section
Функция ЗначениеКлючаАналитики(ПараметрыАналитики) Экспорт
	
	Возврат РасширеннаяАналитикаУчета.ЗначениеКлючаАналитики(Справочники.КлючиАналитикиВидаУчета, ПараметрыАналитики);
	
КонецФункции

// Возвращает новый ключ аналитики
//
// Параметры:
//  ПараметрыАналитики - значения полей создаваемого ключа аналитики
//
//@skip-check doc-comment-export-function-return-section
//@skip-check doc-comment-field-type
//@skip-check doc-comment-field-type-strict
Функция СоздатьКлючАналитики(ПараметрыАналитики) Экспорт
	
	Возврат РасширеннаяАналитикаУчета.СоздатьКлючАналитики(Справочники.КлючиАналитикиВидаУчета, ПараметрыАналитики);
	
КонецФункции

// Заполняет дополнительные поля ключа аналитики при необходимости
//
// Параметры:
//  КлючАналитики      - ссылка ключа аналитики, у которого заполняются дополнительные поля
//  ПараметрыАналитики - значения полей создаваемого ключа аналитики
//
//@skip-check doc-comment-field-type-strict
//@skip-check doc-comment-field-type
Процедура ЗаполнитьДополнительныеПоляКлючаАналитики(КлючАналитики, ПараметрыАналитики) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Проверяет наличие необходимых ключей аналитики и если не находит их, то создает новые
//
// Параметры:
//  МенеджерВременныхТаблиц - должен содержать временную таблицу "втТаблицаАналитики" со
//                            значениями полей аналитики.
//@skip-check doc-comment-field-type
//@skip-check doc-comment-field-type-strict
Процедура ИнициализироватьКлючиАналитики(МенеджерВременныхТаблиц) Экспорт
	
	РасширеннаяАналитикаУчета.ИнициализироватьКлючиАналитики(Справочники.КлючиАналитикиВидаУчета, МенеджерВременныхТаблиц);
	
КонецПроцедуры

// Возвращает массив имен полей соответствующие ключу аналитики
//
//@skip-check doc-comment-export-function-return-section
Функция ИменаПолейАналитики() Экспорт
	
	Возврат ОбщегоНазначенияПоддержкаПроектов.ИменаИзмеренийРегистраСведений(ИмяРегистраАналитики());
	
КонецФункции

// Возвращает имя регистра сведений ключа аналитики
//
//@skip-check doc-comment-export-function-return-section
Функция ИмяРегистраАналитики() Экспорт
	
	Возврат "АналитикаВидаУчета";
	
КонецФункции

// Устанавливает пометку удаления у ключей, соответствующих отбору
//
//@skip-check doc-comment-parameter-section
Процедура УстановитьПометкуУдаления(Отбор, ПометкаУдаления) Экспорт
	
	РасширеннаяАналитикаУчета.УстановитьПометкуУдаленияКлючейАналитики(Справочники.КлючиАналитикиВидаУчета, Отбор, ПометкаУдаления);
	
КонецПроцедуры

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#КонецЕсли
